# Bases de Datos
## Clase Práctica 4: DDL, DML y DQL

### Configuración ⚙️

In [ ]:
import sqlalchemy

Vamos a estar usando el módulo de Python `sqlalchemy`, el cual nos permitirá ejecutar código SQL dentro de una celda de Python, gracias a la función `create_engine`. Esta recibe un parámetro: el _string_ de conexión del servicio de MySQL.

In [ ]:
sqlalchemy.create_engine("mysql://root:root@localhost:3306")

<details>
  <summary>Haz click aquí para ver la explicación del <i>string</i> de conexión</summary>
  
En el _string_ de conexión hay 3 fragmentos relevantes:

$mysql://\underbrace{root}_{usuario}:\underbrace{root}_{contraseña}@localhost:\underbrace{3306}_{puerto}$

Siéntete libre de modificar acordemente el _string_ de conexión en los pocos lugares en los que aparece en este archivo :)

</details>

Necesitamos dos pasos más de configuración:
1. cargar la extensión de SQL:

In [ ]:
%load_ext sql

2. conectarnos al servidor, usando el mismo _string_ de conexión:

In [ ]:
%sql mysql://root:root@localhost:3306

Y... ¡ya estamos listos para ejecutar SQL! 🥳🥳🥳

¡¡¡Vamos a hacer ejercicios!!!

### Ejercicios 🏋️‍♂️
#### _Data Definition Language & Data Manipulation Language_
Dadas las relaciones que se muestran a continuación del diseño de una base de datos, solucione los incisos que le siguen:

**Cliente**(<u>NoC</u>, NombreC, Provincia)  
**Producto**(<u>NoP</u>, NombreP, Precio)  
**Orden**(<u>NoC</u>, <u>NoP</u>, <u>Fecha</u>, Precio, Cantidad)  
NoC **FK** Cliente. No admite nulos  
NoP **FK** Producto. No admite nulos  

a) Escriba las sentencias SQL para la creación de la base de datos `venta` que corresponda con las relaciones anteriores.

> **Voz en off con tono grave:** para ejecutar SQL debemos comenzar el _statement_ con `%sql` en caso de que sólo ocupe una línea, y con `%%sql` si se trata de un bloque. 
> 
> Veamos cómo crear la base de datos:

In [ ]:
%%sql
DROP DATABASE IF EXISTS ventas;
CREATE DATABASE IF NOT EXISTS ventas;

In [ ]:
%sql SHOW DATABASES;

In [ ]:
# y si se crea, se...
%sql

¡A CREAR TABLAS! 😀

In [ ]:
%%sql CREATE TABLE Cliente(
    NoC INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    NombreC NCHAR(50) NOT NULL UNIQUE,
    Provincia NCHAR(25) NOT NULL
);

In [ ]:
%%sql CREATE TABLE Producto(
    NoP INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    NombreP NCHAR(50) NOT NULL UNIQUE,
    Precio DOUBLE UNSIGNED NOT NULL
);

In [ ]:
%%sql CREATE TABLE Orden(
    NoC INT REFERENCES Cliente(NoC)
        ON DELETE SET NULL
        ON UPDATE CASCADE,
    NoP INT REFERENCES Producto(NoP)
        ON DELETE SET NULL
        ON UPDATE CASCADE,
    Fecha DATETIME,
    Precio DOUBLE UNSIGNED,
    Cantidad INT NOT NULL,
    PRIMARY KEY (
        NoC ASC,
        NoP ASC,
        Fecha ASC
    ),
    CHECK (Cantidad > 0)
);

b) Utilizando el lenguaje SQL realice las siguientes modificaciones a la definición de

1. Agregar el atributo Categoría, de tipo VARCHAR y no más de 60 caracteres, a la tabla Producto.

2. Agregar el atributo Dirección, de tipo CHAR y no más de 80 caracteres, a la tabla Cliente.

3. Modificar la cantidad máxima de caracteres a 20 del atributo Categoría de la tabla Producto.

4. Eliminar el atributo Categoría de la tabla Producto.

5. Eliminar el atributo Precio de la tabla Orden.

6. Insertar un cliente cuyo identificador es 1, su Nombre es Edgar Frank Codd y la Provincia, Isla de Portland.

7. Cambiar la provincia a Isla Williams del cliente cuyo nombre es Edgar Frank Codd.

8. Eliminar los clientes cuyo nombre sea Edgar Frank Codd.

#### _Data Query Language_

> **Voz en off con tono grave:** ejecutemos los siguientes comandos para insertar vaaaaarios clientes, productos y órdenes.

In [ ]:
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('International', 'Las Tunas', 'Calle 8355');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Electronic Bike Repair & Supplies', 'Las Tunas', 'Calle 6022');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Premier Sport, Inc.', 'Ciudad de la Habana', 'Calle 6029');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Comfort Road Bicycles', 'Granma', 'Calle 4979');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Metro Sport Equipment', 'Santiago de Cuba', 'Calle 3463');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Green Lake Bike Company', 'Matanzas', 'Calle 5205');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Mountain Works', 'Camagüey', 'Calle 5225');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Continental Pro Cycles', 'Santiago de Cuba', 'Calle 1273');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('A. Datum Corporation', 'Granma', 'Calle 9957');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Trey Research', 'Camagüey', 'Calle 3831');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Andersons Custom Bikes', 'Holguín', 'Calle 8631');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Compete, Inc.', 'Santiago de Cuba', 'Calle 1293');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Beaumont Bikes', 'Las Tunas', 'Calle 5736');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Light Speed', 'Santiago de Cuba', 'Calle 7187');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'SUPERSALES INC.', 'Ciego de Ávila', 'Calle 1729');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Image Makers Bike Center', 'Ciudad de la Habana', 'Calle 5079');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Compete Enterprises, Inc', 'Matanzas', 'Calle 9895');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'G & K Bicycle Corp.', 'Camagüey', 'Calle 7865');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Cycling Master', 'Pinar del Río', 'Calle 4428');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Jeffs Sporting Goods', 'Cienfuegos', 'Calle 9616');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Business Equipment Center', 'Sancti Spíritus', 'Calle 7443');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Victory Bikes', 'La Habana', 'Calle 3460');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Norstan Bike Hut', 'Granma', 'Calle 8152');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'First Rate Bicycles', 'Cienfuegos', 'Calle 5114');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Ready Rentals', 'La Habana', 'Calle 2991');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'First National Sport Co.', 'Villa Clara', 'Calle 7467');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Capital Road Cycles', 'Camagüey', 'Calle 5391');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Wide World Importers', 'Ciudad de la Habana', 'Calle 8902');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Integrated Sport Products', 'Holguín', 'Calle 7617');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Consumer Cycles', 'Granma', 'Calle 7117');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Federal Sport', 'Camagüey', 'Calle 2965');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Advanced Bicycles', 'Granma', 'Calle 9067');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Signature Cycles', 'La Habana', 'Calle 8546');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Indiana Bicycle Center', 'Ciudad de la Habana', 'Calle 6796');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Mitchell Sports', 'Holguín', 'Calle 2972');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Recreation Place', 'Santiago de Cuba', 'Calle 5331');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Inner City Bikes', 'Camagüey', 'Calle 7476');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Allenson Cycles', 'Holguín', 'Calle 1908');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Hills Bicycle Service', 'Las Tunas', 'Calle 7465');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'West Junction Cycles', 'La Habana', 'Calle 9145');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Speed Corporation', 'Ciudad de la Habana', 'Calle 5290');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Legend Cycles', 'Ciego de Ávila', 'Calle 3929');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Inline Accessories', 'Camagüey', 'Calle 5215');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Competition Bike Training Systems', 'Holguín', 'Calle 8282');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Chicago City Saddles', 'Holguín', 'Calle 7879');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Burnett Road Warriors', 'Santiago de Cuba', 'Calle 3654');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Bike Satellite Inc.', 'Sancti Spíritus', 'Calle 6969');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Gardner Touring Cycles', 'Cienfuegos', 'Calle 3580');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Magic Cycles', 'Holguín', 'Calle 3002');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Vision Cycles, Inc.', 'Ciudad de la Habana', 'Calle 1616');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Bergeron Off-Roads', 'Camagüey', 'Calle 7236');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Hybrid Bicycle Center', 'Camagüey', 'Calle 9347');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Jackson Authority', 'Ciudad de la Habana', 'Calle 9357');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Pro Sport Industries', 'Pinar del Río', 'Calle 9100');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Sport Fan Co.', 'Camagüey', 'Calle 1845');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'International Bicycles', 'La Habana', 'Calle 1962');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Wood Fitness', 'Ciego de Ávila', 'Calle 9576');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Midwest Sport, Inc.', 'Sancti Spíritus', 'Calle 2332');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Electronic Bike Co.', 'Camagüey', 'Calle 6128');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'International Sport Assoc.', 'Ciudad de la Habana', 'Calle 6563');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Lindell', 'Pinar del Río', 'Calle 4248');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Training Systems', 'Granma', 'Calle 1560');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Merit Bikes', 'Matanzas', 'Calle 7344');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Circuit Cycles', 'Santiago de Cuba', 'Calle 9898');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'International Trek Center', 'Villa Clara', 'Calle 5704');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Lakewood Bicycle', 'Matanzas', 'Calle 5558');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Knopfler Cycles', 'Sancti Spíritus', 'Calle 1513');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Leaf River Terrain', 'Matanzas', 'Calle 5464');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'National Bike Association', 'Granma', 'Calle 6517');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Sport Playground', 'La Habana', 'Calle 7680');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Vista Road Bikes', 'Villa Clara', 'Calle 9399');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Varsity Sport Co.', 'La Habana', 'Calle 7296');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Crowley Sport', 'Camagüey', 'Calle 8474');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Australia Bike Retailer', 'Camagüey', 'Calle 6127');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Northern Bike Travel', 'Ciudad de la Habana', 'Calle 2660');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Cruger Bike Company', 'Ciego de Ávila', 'Calle 3256');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Custom Frames, Inc.', 'Santiago de Cuba', 'Calle 6117');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Aurora Bike Center', 'Pinar del Río', 'Calle 3372');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'GMA Ski & Bike', 'Holguín', 'Calle 6112');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Bicycle Specialists', 'Camagüey', 'Calle 5646');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Bloomington Multisport', 'Santiago de Cuba', 'Calle 1699');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Illinois Trek & Clothing', 'Sancti Spíritus', 'Calle 2401');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Litware, Inc.', 'Holguín', 'Calle 6782');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Proseware, Inc.', 'Ciego de Ávila', 'Calle 5975');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'American Bicycles and Wheels', 'Camagüey', 'Calle 9949');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Carlson Specialties', 'Matanzas', 'Calle 1580');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Expert Bike Co', 'Sancti Spíritus', 'Calle 5347');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Greenwood Athletic Company', 'Ciudad de la Habana', 'Calle 1645');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Sports House', 'Ciudad de la Habana', 'Calle 2357');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Reliance Fitness, Inc.', 'Villa Clara', 'Calle 5059');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'WestAmerica Bicycle Co.', 'Pinar del Río', 'Calle 4499');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'American Bikes', 'Holguín', 'Calle 2823');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Chicago Rent-All', 'Granma', 'Calle 1266');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Superior Bicycles', 'Sancti Spíritus', 'Calle 9665');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Team Athletic Co.', 'Santiago de Cuba', 'Calle 1151');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Hill Bicycle Center', 'Camagüey', 'Calle 3504');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Northwind Traders', 'Santiago de Cuba', 'Calle 6289');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Trikes, Inc.', 'Holguín', 'Calle 3917');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Marsh', 'Villa Clara', 'Calle 9773');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Holiday Skate & Cycle', 'Granma', 'Calle 9755');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Touring Equipment Center', 'Matanzas', 'Calle 2190');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Fitness Association', 'Granma', 'Calle 2603');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Morgan Bike Accessories', 'Granma', 'Calle 5901');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Professional Athletic Consultants', 'Holguín', 'Calle 5625');

%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (1, 'Adjustable Race', 248);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (2, 'Bearing Ball', 110);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (3, 'BB Ball Bearing', 467);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (4, 'Headset Ball Bearings', 771);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (5, 'Blade', 657);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (6, 'LL Crankarm', 432);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (7, 'ML Crankarm', 354);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (8, 'HL Crankarm', 943);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (9, 'Chainring Bolts', 101);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (10, 'Chainring Nut', 642);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (11, 'Chainring', 28);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (12, 'Crown Race', 248);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (13, 'Chain Stays', 320);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (14, 'Decal 1', 989);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (15, 'Decal 2', 682);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (16, 'Down Tube', 654);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (17, 'Mountain End Caps', 282);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (18, 'Road End Caps', 615);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (19, 'Touring End Caps', 704);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (20, 'Fork End', 701);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (21, 'Freewheel', 949);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (22, 'Flat Washer 1', 93);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (23, 'Flat Washer 6', 160);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (24, 'Flat Washer 2', 381);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (25, 'Flat Washer 9', 797);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (26, 'Flat Washer 4', 169);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (27, 'Flat Washer 3', 793);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (28, 'Flat Washer 8', 307);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (29, 'Flat Washer 5', 823);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (30, 'Flat Washer 7', 886);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (31, 'Fork Crown', 556);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (32, 'Front Derailleur Cage', 716);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (33, 'Front Derailleur Linkage', 699);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (34, 'Guide Pulley', 13);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (35, 'LL Grip Tape', 991);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (36, 'ML Grip Tape', 806);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (37, 'HL Grip Tape', 858);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (38, 'Thin-Jam Hex Nut 9', 62);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (39, 'Thin-Jam Hex Nut 10', 514);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (40, 'Thin-Jam Hex Nut 1', 525);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (41, 'Thin-Jam Hex Nut 2', 272);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (42, 'Thin-Jam Hex Nut 15', 993);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (43, 'Thin-Jam Hex Nut 16', 691);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (44, 'Thin-Jam Hex Nut 5', 386);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (45, 'Thin-Jam Hex Nut 6', 434);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (46, 'Thin-Jam Hex Nut 3', 675);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (47, 'Thin-Jam Hex Nut 4', 677);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (48, 'Thin-Jam Hex Nut 13', 472);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (49, 'Thin-Jam Hex Nut 14', 244);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (50, 'Thin-Jam Hex Nut 7', 353);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (51, 'Thin-Jam Hex Nut 8', 526);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (52, 'Thin-Jam Hex Nut 12', 169);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (53, 'Thin-Jam Hex Nut 11', 346);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (54, 'Hex Nut 5', 691);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (55, 'Hex Nut 6', 395);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (56, 'Hex Nut 16', 155);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (57, 'Hex Nut 17', 949);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (58, 'Hex Nut 7', 85);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (59, 'Hex Nut 8', 973);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (60, 'Hex Nut 9', 488);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (61, 'Hex Nut 22', 638);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (62, 'Hex Nut 23', 46);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (63, 'Hex Nut 12', 120);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (64, 'Hex Nut 13', 214);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (65, 'Hex Nut 1', 86);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (66, 'Hex Nut 10', 311);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (67, 'Hex Nut 11', 548);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (68, 'Hex Nut 2', 306);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (69, 'Hex Nut 20', 997);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (70, 'Hex Nut 21', 875);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (71, 'Hex Nut 3', 796);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (72, 'Hex Nut 14', 220);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (73, 'Hex Nut 15', 100);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (74, 'Hex Nut 4', 178);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (75, 'Hex Nut 18', 428);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (76, 'Hex Nut 19', 955);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (77, 'Handlebar Tube', 402);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (78, 'Head Tube', 774);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (79, 'LL Hub', 947);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (80, 'HL Hub', 122);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (81, 'Keyed Washer', 492);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (82, 'External Lock Washer 3', 320);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (83, 'External Lock Washer 4', 62);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (84, 'External Lock Washer 9', 469);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (85, 'External Lock Washer 5', 360);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (86, 'External Lock Washer 7', 386);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (87, 'External Lock Washer 6', 370);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (88, 'External Lock Washer 1', 7);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (89, 'External Lock Washer 8', 618);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (90, 'External Lock Washer 2', 836);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (91, 'Internal Lock Washer 3', 856);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (92, 'Internal Lock Washer 4', 773);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (93, 'Internal Lock Washer 9', 88);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (94, 'Internal Lock Washer 5', 26);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (95, 'Internal Lock Washer 7', 886);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (96, 'Internal Lock Washer 6', 225);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (97, 'Internal Lock Washer 10', 872);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (98, 'Internal Lock Washer 1', 476);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (99, 'Internal Lock Washer 8', 300);

%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (83, 1, '2011-05-17 00:00:00', '4');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (32, 38, '2011-05-17 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (32, 39, '2011-05-17 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (38, 203, '2011-05-17 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (85, 4, '2011-05-17 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (92, 185, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (11, 186, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (84, 6, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (84, 7, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (84, 8, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 82, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 83, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 84, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 85, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 86, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 101, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 102, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 103, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 104, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 105, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (13, 9, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (13, 10, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (13, 11, '2012-01-14 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 117, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 118, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 119, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 120, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (80, 446, '2012-01-14 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (47, 9, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (47, 10, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (47, 11, '2012-01-14 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (81, 177, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (46, 176, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (21, 12, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (27, 196, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (27, 197, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 171, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 172, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 173, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 174, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 175, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 413, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 414, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 415, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 416, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 417, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (93, 179, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (64, 32, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (64, 33, '2012-01-15 00:00:00', '550');

c) Implemente las siguientes consultas:

9. Obtener los clientes cuyos nombres comienzan con "International".

10. Obtener el nombre y el precio de los productos que se han vendido.

11. Obtener el nombre, la dirección y la provincia de los clientes que viven en la provincia "La Habana" o "Pinar del Río".

12. ¿Cuántos clientes hay por provincia?

> **CAMBIEMOS DE ESCENARIO...**

La Oficina del Festival Internacional del Nuevo Cine Latinoamericano es la
encargada cada año de la organización del Festival Internacional del Nuevo Cine
Latinoamericano. Para esto cuenta con un sistema automatizado que maneja
cierta información contenida en una base de datos de la cual se muestra un
fragmento a continuación:

**Película** (<u>IDPeli</u>, Título , Director, País, Duración, Año, IDSecc) 

IDSecc **FK** Sección. No admite nulos 


**Jurado** (<u>IDJur</u>, Nombre, País, FechaDeNacimiento, IDSecc)

IDSecc **FK** Sección. No admite nulos 

**Sección** (<u>IDSecc</u>, Nombre, Tipo)

**PelículaGanadora** (<u>IDPremiada</u>, IDPeli, NombrePremio)

IDPeli **FK** Película. No admite nulos

In [ ]:
%%sql 

DROP DATABASE IF EXISTS FestivalDeCine34;
CREATE DATABASE FestivalDeCine34;
USE FestivalDeCine34;

In [ ]:
%%sql 

CREATE TABLE IF NOT EXISTS Sección (
  IDSecc int(11) NOT NULL AUTO_INCREMENT,
  Nombre varchar(50) NOT NULL,
  Tipo varchar(50) NOT NULL,
  PRIMARY KEY (IDSecc),
  UNIQUE (Nombre)
);

In [ ]:
%%sql 

INSERT INTO `Sección` (`IDSecc`, `Nombre`, `Tipo`) VALUES
(1, 'Panorama Latinoamericano', 'Fuera de competencia'),
(2, 'Panorama Contemporáneo Internacional', 'Fuera de competencia'),
(3, 'Óperas Primas', 'En competencia'),
(4, 'Ficción', 'En competencia'),
(5, 'World Cinema Fund', 'Fuera de competencia'),
(6, 'Muestra de Cine Polaco', 'Fuera de competencia'),
(7, 'Documental', 'En competencia'),
(8, 'Muestra de Cine Italiano', 'Fuera de competencia'),
(9, 'Muestra de Cine Canadiense', 'Fuera de competencia'),
(10, 'Muestra de Cine Alemán', 'Fuera de competencia'),
(11, 'Muestra de Cine Español', 'Fuera de competencia');

In [ ]:
%%sql 

CREATE TABLE IF NOT EXISTS Jurado (
  IDSecc INT REFERENCES Sección(IDSecc) ON UPDATE CASCADE,
  IDJur int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
  Nombre varchar(50) NOT NULL,
  País char(10) NOT NULL,
  FechaDeNacimiento date NOT NULL
);

In [ ]:
%%sql 

INSERT INTO `Jurado` (`IDJur`, `Nombre`, `País`, `FechaDeNacimiento`, `IDSecc`) VALUES
(1, 'Boris Quercia', 'Chile', '1955-03-02', 4),
(2, 'Gastón Pauls', 'Argentina', '1965-02-05', 4),
(3, 'Úrsula Pruneda', 'México', '1944-12-04', 4),
(4, 'Conceiçáo Senna', 'Brasil', '1948-11-23', 4),
(5, 'Manuel Herrera', 'Cuba', '1976-06-21', 4),
(6, 'Diego Vega', 'Perú', '1958-03-17', 3),
(7, 'Marité Ugás', 'Venezuela', '1966-03-27', 3),
(8, 'Esteban Insausti', 'Cuba', '1977-07-02', 3),
(9, 'Aldo Garay', 'Uruguay', '1970-05-03', 7),
(10, 'Carlos Azpurúa', 'Venezuela', '1973-08-04', 7),
(11, 'Rolando Almirante', 'Cuba', '1973-06-05', 7);

In [ ]:
%%sql 

CREATE TABLE IF NOT EXISTS Película (
  IDPeli int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
  Título varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  Director varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  País char(10) COLLATE utf8_unicode_ci NOT NULL,
  Duración smallint(5) unsigned NOT NULL,
  Año smallint(5) unsigned NOT NULL,
  IDSecc INT REFERENCES Sección(IDSecc) ON UPDATE CASCADE
);

In [ ]:
%%sql 

INSERT INTO `Película` (`IDPeli`, `Título`, `Director`, `País`, `Duración`, `Año`, `IDSecc`) VALUES
(1, 'Un feliz acontecimiento', 'Rémi Bezançon', 'Francia', 107, 2011, 2),
(2, 'Dromómanos', 'Inés de Oliveira Cézar', 'Argentina', 90, 2012, 4),
(3, 'Polvo', 'Julio Hernández Cordón', 'Guatemala', 80, 2012, 5),
(4, 'Rosa', 'Wodjciechs Marzowski', 'Polonia', 94, 2012, 6),
(5, 'La demora', 'Rodrígo Plá', 'Uruguay', 84, 2012, 4),
(6, 'Los salvajes', 'Alejandro Fadel', 'Argentina', 119, 2012, 3),
(7, 'El hombre que vendrá', 'Giorgio Diritti', 'Italia', 117, 2009, 8),
(8, 'La suerte en tus manos', 'Daniel Burman', 'Argentina', 107, 2011, 1),
(9, 'Elefante blanco', 'Pablo Trapero', 'Argentina', 110, 2012, 4),
(10, 'La lucha de Ana', 'Bladimir Abud', 'República', 90, 2011, 1),
(11, 'Pescador', 'Sebastián Cordero', 'Ecuador', 96, 2011, 4),
(12, 'Mi universo en minúsculas', 'Hatuey Viveros', 'México', 90, 2011, 3),
(13, 'Hoy', 'Tata Amaral', 'Brasil', 82, 2011, 4),
(14, 'La película de Ana', 'Daniel Díaz Torres', 'Cuba', 100, 2012, 4),
(15, 'Cornelia frente al espejo', 'Daniel Rosenfeld', 'Argentina', 103, 2012, 3),
(16, 'Melaza', 'Carlos Lechuga', 'Cuba', 80, 2012, 3),
(17, 'Villegas', 'Gonzalo Tobal', 'Argentina', 98, 2012, 3),
(18, 'Las cosas como son', 'Fernando Lavanderos Montero', 'Chile', 105, 2012, 4),
(19, 'Chocó', 'Jhonny Hendrix Hinestroza', 'Colombia', 80, 2011, 3),
(20, 'El último tren a casa', 'Lixin Fan', 'Canadá', 85, 2009, 9),
(21, 'Bárbara', 'Christian Petzold', 'Alemania', 105, 2012, 10),
(22, 'El páramo', 'Jaime Osorio Márquez', 'Colombia', 107, 2011, 1),
(23, 'No', 'Pablo Larraín', 'Chile', 115, 2012, 4),
(24, 'De martes a martes', 'Gustavo Fernández Triviño', 'Argentina', 94, 2011, 3),
(25, 'El gran sueño de Konrad Koch', 'Sebastian Groebler', 'Alemania', 113, 2010, 10),
(26, 'Violeta se fue a los cielos', 'Andrés Wood', 'Chile', 110, 2011, 4),
(27, 'Viento de Oeste', 'Robert Thalheim', 'Alemania', 89, 2011, 10),
(28, 'Parón en el camino', 'Andreas Dresen', 'Alemania', 110, 2011, 10),
(29, 'Evelyn', 'Isabel de Ocampo', 'España', 96, 2011, 11),
(30, 'Era uma vez eu, Verónica', 'Marcelo Gómes', 'Brasil', 91, 2011, 4),
(31, 'Penumbras', 'Charlie Medina', 'Cuba', 79, 2012, 3),
(32, 'Los equilibristas', 'Ivano de Matteo', 'Italia', 100, 2012, 8),
(33, 'Un hogar de fin de semana', 'Hans-Christian Schmid', 'Alemania', 85, 2012, 10),
(34, 'Jaque mate', 'José María Cabral', 'República', 80, 2011, 1),
(35, 'Fausto', 'Alexander Sokurov', 'Rusia', 134, 2011, 2),
(36, 'Monsieur Lazhar', 'Philippe Falardeau', 'Canadá', 94, 2011, 9),
(37, 'Starbuck', 'Ken Scott', 'Canadá', 109, 2011, 9);

In [ ]:
%%sql 

CREATE TABLE IF NOT EXISTS PelículaGanadora (
  IDPremiada int(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
  IDPeli INT REFERENCES Película(IDPeli) ON UPDATE CASCADE,
  NombrePremio varchar(100) COLLATE utf8_unicode_ci NOT NULL
);

In [ ]:
%%sql 

INSERT INTO `PelículaGanadora` (`IDPremiada`, `IDPeli`, `NombrePremio`) VALUES
(1, 16, '6to Premio de la Popularidad'),
(2, 16, 'Premio El Mégano'),
(3, 9, 'Premio Coral de Edición'),
(4, 9, 'Mención SIGNIS'),
(5, 9, '5to Premio de la Popularidad'),
(6, 9, 'Premio Caminos'),
(7, 14, 'Premio Coral de Actuación Femenina'),
(8, 14, 'Premio Coral de Guión'),
(9, 14, 'Premio de Distribución de Amazonia Films'),
(10, 14, '2do Premio de la Popularidad'),
(11, 14, 'Premio Otorgado por el Círculo de Periodistas de Cultura de la UPEC'),
(12, 5, 'Premio Coral de Música Original'),
(13, 5, 'Premio Únete'),
(14, 11, 'Premio Coral de Actuación Masculina'),
(15, 30, 'Mención del Jurado'),
(16, 23, '1er Premio Coral'),
(17, 23, 'Premio SIGNIS'),
(18, 23, '3er Premio de la Popularidad'),
(19, 23, 'Premio de la Asociación Cubana de la Prensa Cinematográfica'),
(20, 19, 'Premio Roque Dalton'),
(21, 6, '2do Premio Coral'),
(22, 6, 'Premio Coral a la Mejor Contribución Artística (Mejor Dirección)'),
(23, 26, '2do Premio Coral'),
(24, 26, 'Premio Coral de Dirección Artística'),
(25, 26, 'Premio de la Asociación de Cine, Radio y Televisión de la UNEAC'),
(26, 26, 'Premio Glauber Rocha');

> **Voz en off con tono grave:**  Contando con esta info se puede entonces dar respuesta a los siguientes incisos utilizando el

I) Obtenga la cantidad de películas registradas por cada director.

II) Recupere ordenados alfabéticamente los nombres de aquellas secciones en las que se presentaron películas cubanas o argentinas cuya duración era de 90 minutos o más.

III) Obtener el tiempo máximo de película registrado por cada sección .

IV) Obtener el nombre de las secciones que cuentan con jueces con menos de 20 años

ups, y con más de 20!?

V) Las secciones sólo pueden ser del tipo "En competencia" o "Fuera de competencia". Muestre la cantidad y el promedio de duración de las películas presentadas en cada uno de estos tipos de sección.

VI) Obtener el título, director y la cantidad de premios recibidos por las 5 películas más laureadas.

VII) Obtenga el nombre de los miembros del jurado que participaron en secciones en las que se premiaron al menos a cinco películas distintas. Los jurados deben aparecer ordenados según su edad, comenzando por el mayor.

VIII) Muestre los jueces que se han asignado a secciones en las que participan películas de su mismo país. Agregue también su país y la sección involucrada.

IX) Obtener el nombre y la cantidad total de películas asociadas a las secciones en las que se hayan registrado al menos 1 película ganadora.

X) Presente el título y el director de las películas que fueron galardonadas y poseen una duración mayor que el promedio.